Chen-qin-neverstop/STM32/STM32Part/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include <string.h>
#include "stm32f1xx_hal_tim.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
TIM_HandleTypeDef htim3;

UART_HandleTypeDef huart1;

/* USER CODE BEGIN PV */

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_TIM3_Init(void);
/* USER CODE BEGIN PFP */

void Forward()   // PWM100%
{
		HAL_GPIO_WritePin(FR1_GPIO_Port,FR1_Pin,GPIO_PIN_SET);
		HAL_GPIO_WritePin(FR2_GPIO_Port,FR2_Pin,GPIO_PIN_RESET);
		HAL_GPIO_WritePin(FL1_GPIO_Port,FL1_Pin,GPIO_PIN_SET);
		HAL_GPIO_WritePin(FL2_GPIO_Port,FL2_Pin,GPIO_PIN_RESET);
		HAL_GPIO_WritePin(BR1_GPIO_Port,BR1_Pin,GPIO_PIN_SET);
		HAL_GPIO_WritePin(BR2_GPIO_Port,BR2_Pin,GPIO_PIN_RESET);
		HAL_GPIO_WritePin(BL1_GPIO_Port,BL1_Pin,GPIO_PIN_SET);
		HAL_GPIO_WritePin(BL2_GPIO_Port,BL2_Pin,GPIO_PIN_RESET);
}
// 左转弯（左电机80%，右电机100%）
void TurnLeft() {
	__HAL_TIM_SET_COMPARE(&htim3,TIM_CHANNEL_3,79);
	__HAL_TIM_SET_COMPARE(&htim3,TIM_CHANNEL_4,79);
	HAL_GPIO_WritePin(FR1_GPIO_Port,FR1_Pin,GPIO_PIN_SET);
	HAL_GPIO_WritePin(FR2_GPIO_Port,FR2_Pin,GPIO_PIN_RESET);
}

// 右转弯（右电机80%，左电机100%）
void TurnRight() {
	__HAL_TIM_SET_COMPARE(&htim3,TIM_CHANNEL_1,79);
	__HAL_TIM_SET_COMPARE(&htim3,TIM_CHANNEL_2,79);
	HAL_GPIO_WritePin(FL1_GPIO_Port,FL1_Pin,GPIO_PIN_SET);
	HAL_GPIO_WritePin(FL2_GPIO_Port,FL2_Pin,GPIO_PIN_RESET);
}

// 急右转（右电机50%，左电机100%）
void HardRight() {
	__HAL_TIM_SET_COMPARE(&htim3,TIM_CHANNEL_1,49);
	__HAL_TIM_SET_COMPARE(&htim3,TIM_CHANNEL_2,49);
	HAL_GPIO_WritePin(FL1_GPIO_Port,FL1_Pin,GPIO_PIN_SET);
	HAL_GPIO_WritePin(FL2_GPIO_Port,FL2_Pin,GPIO_PIN_RESET);
}

// 急左转（左电机50%，右电机100%）
void HardLeft() {
	__HAL_TIM_SET_COMPARE(&htim3,TIM_CHANNEL_3,49);
	__HAL_TIM_SET_COMPARE(&htim3,TIM_CHANNEL_4,49);
	HAL_GPIO_WritePin(FR1_GPIO_Port,FR1_Pin,GPIO_PIN_SET);
	HAL_GPIO_WritePin(FR2_GPIO_Port,FR2_Pin,GPIO_PIN_RESET);
}

// 停止所有电机
void Stop() {
  HAL_GPIO_WritePin(FR1_GPIO_Port, FR1_Pin, GPIO_PIN_RESET);
  HAL_GPIO_WritePin(FR2_GPIO_Port, FR2_Pin, GPIO_PIN_RESET);
  HAL_GPIO_WritePin(FL1_GPIO_Port, FL1_Pin, GPIO_PIN_RESET);
  HAL_GPIO_WritePin(FL2_GPIO_Port, FL2_Pin, GPIO_PIN_RESET);
  HAL_GPIO_WritePin(BR1_GPIO_Port, BR1_Pin, GPIO_PIN_RESET);
  HAL_GPIO_WritePin(BR2_GPIO_Port, BR2_Pin, GPIO_PIN_RESET);
  HAL_GPIO_WritePin(BL1_GPIO_Port, BL1_Pin, GPIO_PIN_RESET);
  HAL_GPIO_WritePin(BL2_GPIO_Port, BL2_Pin, GPIO_PIN_RESET);
  HAL_Delay(100);
}
/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_USART1_UART_Init();
  MX_TIM3_Init();
  /* USER CODE BEGIN 2 */
  uint8_t receiveData[2];
  HAL_TIM_PWM_Start(&htim3,TIM_CHANNEL_1);
  HAL_TIM_PWM_Start(&htim3,TIM_CHANNEL_2);
  HAL_TIM_PWM_Start(&htim3,TIM_CHANNEL_3);
  HAL_TIM_PWM_Start(&htim3,TIM_CHANNEL_4);

  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {

	  	HAL_GPIO_ReadPin(KEY_GPIO_Port,KEY_Pin);
	  	if(HAL_GPIO_ReadPin(KEY_GPIO_Port,KEY_Pin) == GPIO_PIN_SET)
	  	{
	  		HAL_GPIO_WritePin(BR1_GPIO_Port,BR1_Pin,GPIO_PIN_SET);
	  		HAL_GPIO_WritePin(BR2_GPIO_Port,BR2_Pin,GPIO_PIN_RESET);
	  		HAL_GPIO_WritePin(BL1_GPIO_Port,BL1_Pin,GPIO_PIN_SET);
	  		HAL_GPIO_WritePin(BL2_GPIO_Port,BL2_Pin,GPIO_PIN_RESET);
	  		HAL_UART_Receive(&huart1,receiveData,2,1000);         // 最大的等待时间是1000ms
	  		GPIO_PinState state = GPIO_PIN_SET;
	  		if(receiveData[0] == 'F')
	  		{
	  			Forward();
	  			HAL_Delay(10);
	  		}
	  		if(receiveData[0] == 'T')
	  		{
	  			if(receiveData[1] == 'L')
	  			{
	  				TurnLeft();
	  			}
	  			else if(receiveData[1] == 'R')
 				{
	  				TurnRight();
				}
	  		}
	  		if(receiveData[0] == 'H')
	  		{
	  			if(receiveData[1] == 'L')
	  			{
	  				HardLeft();
	  			}
	  			else if(receiveData[1] == 'R')
 				{
	  				HardRight();
				}
	  		}
	  		if(receiveData[0] == 'S')
	  		{
	  			Stop();
	  		}

	    } else
	    {
	    	  HAL_GPIO_WritePin(FR1_GPIO_Port, FR1_Pin, GPIO_PIN_RESET);
	    	  HAL_GPIO_WritePin(FR2_GPIO_Port, FR2_Pin, GPIO_PIN_RESET);
	    	  HAL_GPIO_WritePin(FL1_GPIO_Port, FL1_Pin, GPIO_PIN_RESET);
	    	  HAL_GPIO_WritePin(FL2_GPIO_Port, FL2_Pin, GPIO_PIN_RESET);
	    	  HAL_GPIO_WritePin(BR1_GPIO_Port, BR1_Pin, GPIO_PIN_RESET);
	    	  HAL_GPIO_WritePin(BR2_GPIO_Port, BR2_Pin, GPIO_PIN_RESET);
	    	  HAL_GPIO_WritePin(BL1_GPIO_Port, BL1_Pin, GPIO_PIN_RESET);
	    	  HAL_GPIO_WritePin(BL2_GPIO_Port, BL2_Pin, GPIO_PIN_RESET);
	    	  HAL_Delay(100000);
	    }
    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */
  }
  /* USER CODE END 3 */
}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

  /** Initializes the RCC Oscillators according to the specified parameters
  * in the RCC_OscInitTypeDef structure.
  */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_BYPASS;
  RCC_OscInitStruct.HSEPredivValue = RCC_HSE_PREDIV_DIV1;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PLLMUL = RCC_PLL_MUL9;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }

  /** Initializes the CPU, AHB and APB buses clocks
  */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV2;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_2) != HAL_OK)
  {
    Error_Handler();
  }
}

/**
  * @brief TIM3 Initialization Function
  * @param None
  * @retval None
  */
static void MX_TIM3_Init(void)
{

  /* USER CODE BEGIN TIM3_Init 0 */

  /* USER CODE END TIM3_Init 0 */

  TIM_ClockConfigTypeDef sClockSourceConfig = {0};
  TIM_MasterConfigTypeDef sMasterConfig = {0};
  TIM_OC_InitTypeDef sConfigOC = {0};

  /* USER CODE BEGIN TIM3_Init 1 */

  /* USER CODE END TIM3_Init 1 */
  htim3.Instance = TIM3;
  htim3.Init.Prescaler = 72-1;
  htim3.Init.CounterMode = TIM_COUNTERMODE_UP;
  htim3.Init.Period = 100-1;
  htim3.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
  htim3.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_DISABLE;
  if (HAL_TIM_Base_Init(&htim3) != HAL_OK)
  {
    Error_Handler();
  }
  sClockSourceConfig.ClockSource = TIM_CLOCKSOURCE_INTERNAL;
  if (HAL_TIM_ConfigClockSource(&htim3, &sClockSourceConfig) != HAL_OK)
  {
    Error_Handler();
  }
  if (HAL_TIM_PWM_Init(&htim3) != HAL_OK)
  {
    Error_Handler();
  }
  sMasterConfig.MasterOutputTrigger = TIM_TRGO_RESET;
  sMasterConfig.MasterSlaveMode = TIM_MASTERSLAVEMODE_DISABLE;
  if (HAL_TIMEx_MasterConfigSynchronization(&htim3, &sMasterConfig) != HAL_OK)
  {
    Error_Handler();
  }
  sConfigOC.OCMode = TIM_OCMODE_PWM1;
  sConfigOC.Pulse = 50;
  sConfigOC.OCPolarity = TIM_OCPOLARITY_HIGH;
  sConfigOC.OCFastMode = TIM_OCFAST_DISABLE;
  if (HAL_TIM_PWM_ConfigChannel(&htim3, &sConfigOC, TIM_CHANNEL_1) != HAL_OK)
  {
    Error_Handler();
  }
  if (HAL_TIM_PWM_ConfigChannel(&htim3, &sConfigOC, TIM_CHANNEL_2) != HAL_OK)
  {
    Error_Handler();
  }
  if (HAL_TIM_PWM_ConfigChannel(&htim3, &sConfigOC, TIM_CHANNEL_3) != HAL_OK)
  {
    Error_Handler();
  }
  if (HAL_TIM_PWM_ConfigChannel(&htim3, &sConfigOC, TIM_CHANNEL_4) != HAL_OK)
  {
    Error_Handler();
  }
  /* USER CODE BEGIN TIM3_Init 2 */

  /* USER CODE END TIM3_Init 2 */
  HAL_TIM_MspPostInit(&htim3);

}

/**
  * @brief USART1 Initialization Function
  * @param None
  * @retval None
  */
static void MX_USART1_UART_Init(void)
{

  /* USER CODE BEGIN USART1_Init 0 */

  /* USER CODE END USART1_Init 0 */

  /* USER CODE BEGIN USART1_Init 1 */

  /* USER CODE END USART1_Init 1 */
  huart1.Instance = USART1;
  huart1.Init.BaudRate = 9600;
  huart1.Init.WordLength = UART_WORDLENGTH_8B;
  huart1.Init.StopBits = UART_STOPBITS_1;
  huart1.Init.Parity = UART_PARITY_NONE;
  huart1.Init.Mode = UART_MODE_TX_RX;
  huart1.Init.HwFlowCtl = UART_HWCONTROL_NONE;
  huart1.Init.OverSampling = UART_OVERSAMPLING_16;
  if (HAL_UART_Init(&huart1) != HAL_OK)
  {
    Error_Handler();
  }
  /* USER CODE BEGIN USART1_Init 2 */

  /* USER CODE END USART1_Init 2 */

}

/**
  * @brief GPIO Initialization Function
  * @param None
  * @retval None
  */
static void MX_GPIO_Init(void)
{
  GPIO_InitTypeDef GPIO_InitStruct = {0};
  /* USER CODE BEGIN MX_GPIO_Init_1 */

  /* USER CODE END MX_GPIO_Init_1 */

  /* GPIO Ports Clock Enable */
  __HAL_RCC_GPIOD_CLK_ENABLE();
  __HAL_RCC_GPIOA_CLK_ENABLE();
  __HAL_RCC_GPIOB_CLK_ENABLE();

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(GPIOA, FR1_Pin|FR2_Pin, GPIO_PIN_SET);

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(BL1_GPIO_Port, BL1_Pin, GPIO_PIN_RESET);

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(GPIOB, BL2_Pin|BR1_Pin|BR2_Pin, GPIO_PIN_SET);

  /*Configure GPIO pins : FR1_Pin FR2_Pin */
  GPIO_InitStruct.Pin = FR1_Pin|FR2_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

  /*Configure GPIO pins : BL1_Pin BL2_Pin BR1_Pin BR2_Pin */
  GPIO_InitStruct.Pin = BL1_Pin|BL2_Pin|BR1_Pin|BR2_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

  /*Configure GPIO pin : KEY_Pin */
  GPIO_InitStruct.Pin = KEY_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(KEY_GPIO_Port, &GPIO_InitStruct);

  /* USER CODE BEGIN MX_GPIO_Init_2 */

  /* USER CODE END MX_GPIO_Init_2 */
}

/* USER CODE BEGIN 4 */

/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
